Revit 2027 API
BuiltInFailures.DirectShapeFailures.CannotCreateDirectShapeRefsWarning Property
 Cannot create reference objects for a DirectShape.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreateDirectShapeRefsWarning { get; }
Public Shared ReadOnly Property CannotCreateDirectShapeRefsWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreateDirectShapeRefsWarning {
	FailureDefinitionId^ get ();
}
static member CannotCreateDirectShapeRefsWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DirectShapeFailures Class
Autodesk.Revit.DB Namespace